<?php
/**
 * Created by PhpStorm.
 * User: froz
 * Date: 14.06.19
 * Time: 9:35
 */

class cityData
{
    protected $token = '5c862a155699f5.76303383';

    private $target;

    private $cityName;

    private $data;

    public function __construct($city)
    {
        $city_id = include_once('/config/city_id.php');
        $this->cityName = $city_id[0];
        $this->target = 'https://api.gismeteo.net/v2/weather/forecast/by_day_part/' .$city[1].'/?days=5';
        $headers = [
            'Content-Type: application/x-www-form-urlencoded; charset=utf-8',
            'X-Gismeteo-Token:' .$this->token
        ];
        $ch = curl_init();
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
        curl_setopt($ch, CURLOPT_URL, $this->target);
        curl_setopt($ch, CURLOPT_HTTPHEADER, $headers);
        $result = json_decode(curl_exec($ch));
        curl_close($ch);
        foreach ($result->response as $key => $item)
            $this->data[$this->cityName] = ['dat' => $item->date->UTC, 'tday' => round($item->temperature->air->avg->C), 'wind_dir' => $item->wind->direction->max->degree, 'wind_speed' => $item->wind->speed->max->m_s, 'weather_conditions' => $item->humidity->percent->avg, 'pday' => $item->pressure->mm_hg_atm->max];
    }

    public function getData(){
        return $this->data;
    }

    public static function getPhenomen($cludiness, $precipit, $phenomenon)
    {
        $arrClud = [
            "Ясно",
            "Малооблачно",
            "Облачно",
            "Пасмурно",
            101 => "Переменная облачность",
        ];
        $arrPrec = [
            "Нет осадков",
            "Дождь",
            "Снег",
            "Смешанные осадки",
        ];
        $arrPhenom = [
            4 => "Дым",
            5 => "Мгла",
            6 => "Пыльная буря",
            7 => "Пыльная буря",
            8 => "Пыльные вихри",
            9 => "Пыльная буря",
            10 => "Дымка",
            11 => "Туман",
            12 => "Туман",
            13 => "Зарница",
            18 => "Шквалы",
            19 => "Смерч",
            20 => "Морось",
            24 => "Гололед",
            25 => "Ливень",
            27 => "Град",
            28 => "Туман",
            30 => "Пыльная буря",
            31 => "Пыльная буря",
            32 => "Пыльная буря",
            33 => "Пыльная буря",
            34 => "Пыльная буря",
            35 => "Пыльная буря",
            36 => "Поземок",
            37 => "Сильный поземок",
            38 => "Метель",
            39 => "Сильная метель",
            40 => "Туман",
            41 => "Туман",
            42 => "Туман",
            43 => "Туман",
            44 => "Туман",
            45 => "Туман",
            46 => "Туман",
            47 => "Туман",
            48 => "Туман",
            49 => "Туман",
            50 => "Небольшая морось",
            51 => "Морось",
            52 => "Морось",
            53 => "Морось",
            54 => "Сильная морось",
            55 => "Морось",
            56 => "Небольшая морось",
            57 => "Морось",
            66 => "Гололед",
            67 => "Гололед",
            68 => "Дождь со снегом",
            69 => "Дождь со снегом",
            74 => "Снегопад",
            75 => "Снегопад",
            76 => "Ледяные иглы",
            77 => "Снежные зёрна",
            78 => "Снежные кристаллы",
            79 => "Ледяной дождь",
            81 => "Ливень",
            82 => "Сильный ливень",
            83 => "Небольшие осадки",
            84 => "Ливень",
            87 => "Снежная крупа",
            88 => "Снежная крупа",
            89 => "Слабый град",
            90 => "Град",
            93 => "Град",
            94 => "Град",
            96 => "Град",
            99 => "Град",
            104 => "Мгла",
            105 => "Мгла",
            110 => "Дымка",
            111 => "Ледяные иглы",
            112 => "Зарница",
            118 => "Шквалы",
            120 => "Туман",
            122 => "Морось",
            125 => "Гололёд",
            130 => "Туман",
            131 => "Туман",
            132 => "Туман",
            133 => "Туман",
            134 => "Туман",
            135 => "Туман",
            147 => "Осадки",
            148 => "Сильные осадки",
            150 => "Морось",
            151 => "Небольшая морось",
            152 => "Морось",
            153 => "Сильная морось",
            154 => "Небольшая морось",
            155 => "Морось",
            156 => "Сильная морось",
            164 => "Гололед",
            165 => "Гололед",
            166 => "Гололед",
            174 => "Слабая ледяная крупа",
            175 => "Ледяная крупа",
            176 => "Сильная ледяная крупа",
            177 => "Снежные зерна",
            178 => "Ледяные кристалы",
            180 => "Ливневый дождь",
            189 => "Град",
            193 => "Град",
            196 => "Град",
            199 => "Смерч",
            280 => "Ливневый снег",
            380 => "Ливневые осадки",
            500 => "Осадки",
            501 => "Сильные осадки",
            528 => "Морозный туман",
            568 => "Небольшие осадки",
        ];

        return $arrClud[$cludiness] . $arrPrec[$precipit];
    }
}